Revit 2027 API
BuiltInFailures.SketchFailures.SketchOverconstrainedError Property
 Sketch is overconstrained.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId SketchOverconstrainedError { get; }
Public Shared ReadOnly Property SketchOverconstrainedError As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ SketchOverconstrainedError {
	FailureDefinitionId^ get ();
}
static member SketchOverconstrainedError : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SketchFailures Class
Autodesk.Revit.DB Namespace